avnet-iotconnect/iotc-stm32-n6-demos/Projects/pose_estimation/STM32N6/Src/main.c
  Fuse_Programming();

  NPUCache_config();

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  MX_USART2_UART_Init();

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

  /*** NN Init ****************************************************************/
  LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(Default);
  const LL_Buffer_InfoTypeDef *nn_in_info = LL_ATON_Input_Buffers_Info_Default();
  const LL_Buffer_InfoTypeDef *nn_out_info = LL_ATON_Output_Buffers_Info_Default();

  nn_in = (uint8_t *) LL_Buffer_addr_start(&nn_in_info[0]);
  float32_t *nn_out[MAX_NUMBER_OUTPUT];
  int32_t nn_out_len[MAX_NUMBER_OUTPUT];

  int number_output = 0;

  /* Count number of outputs */
  while (nn_out_info[number_output].name != NULL)
  {
    number_output++;
  }
  assert(number_output <= MAX_NUMBER_OUTPUT);

  for (int i = 0; i < number_output; i++)
  {
    nn_out[i] = (float32_t *) LL_Buffer_addr_start(&nn_out_info[i]);
    nn_out_len[i] = LL_Buffer_len(&nn_out_info[i]);
  }

  uint32_t nn_in_len = LL_Buffer_len(&nn_in_info[0]);
  uint32_t pitch_nn = 0;

  UNUSED(nn_in_len);

  /*** Post Processing Init ***************************************************/
  app_postprocess_init(&pp_params);

  /*** Camera Init ************************************************************/

  CAM_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);

  LCD_init();

  /* da16k module init */
  da16k_cfg_t cfg = {0};
  da16k_init(&cfg);

  /* Start LCD Display camera pipe stream */
  CAM_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
	//IOTCONNECT telemetry data init
	memset(x, 0, sizeof(x));
	memset(y, 0, sizeof(y));
	memset(color, 0, sizeof(color));
	iotc_inference = 0;

    CAM_IspUpdate();

    if (pitch_nn != (NN_WIDTH * NN_BPP))
    {
      /* Start NN camera single capture Snapshot */
      CAM_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
    }
    else
    {
      /* Start NN camera single capture Snapshot */
      CAM_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
    }

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

    if (pitch_nn != (NN_WIDTH * NN_BPP))
    {
      SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
      img_crop(dcmipp_out_nn, nn_in, pitch_nn, NN_WIDTH, NN_HEIGHT, NN_BPP);
      SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
    }

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    LL_ATON_RT_Main(&NN_Instance_Default);
    ts[1] = HAL_GetTick();

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      float32_t *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }

    //IOTCONNECT
    uint32_t current_time = HAL_GetTick();
    if ((current_time - last_send_time) < IOTC_INTERVAL) {
      continue;
    }
    last_send_time = current_time;

    //only send data to iotconnect when at least three points showing up in order to avoid floating point data
    if ( !((x[0] == 0 && y[0] == 0) || (x[1] == 0 && y[1] == 0) || (x[2] == 0 && y[2] == 0)) ) {
      //printf("Sending the message to IOTCONNECT...\r\n");
      for (int i = 0; i < 13; i++) {
        convert_color_to_str(color[i], &iotc_color_str[i][0]);
      }
	  da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point1_x,%d,point1_y,%d,point1_color,%s,point2_x,%d,point2_y,%d,point2_color,%s,inference,%d\r\n",
										   x[0], y[0], &iotc_color_str[0][0], x[1], y[1], &iotc_color_str[1][0], iotc_inference);

	  if (!((x[2] == 0 && y[2] == 0) && (x[3] == 0 && y[3] == 0))) {
		HAL_Delay(100);
	    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point3_x,%d,point3_y,%d,point3_color,%s,point4_x,%d,point4_y,%d,point4_color,%s\r\n",
	  										   x[2], y[2], &iotc_color_str[2][0], x[3], y[3], &iotc_color_str[3][0]);
	  }

	  if (!((x[4] == 0 && y[4] == 0) && (x[5] == 0 && y[5] == 0))) {
		HAL_Delay(100);
	    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point5_x,%d,point5_y,%d,point5_color,%s,point6_x,%d,point6_y,%d,point6_color,%s\r\n",
	  										   x[4], y[4], &iotc_color_str[4][0], x[5], y[5], &iotc_color_str[5][0]);
	  }
	  if (!((x[6] == 0 && y[6] == 0) && (x[7] == 0 && y[7] == 0))) {
		HAL_Delay(100);
	    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point7_x,%d,point7_y,%d,point7_color,%s,point8_x,%d,point8_y,%d,point8_color,%s\r\n",
	  	  										   x[6], y[6], &iotc_color_str[6][0], x[7], y[7], &iotc_color_str[7][0]);
	  }
	  if (!((x[8] == 0 && y[8] == 0) && (x[9] == 0 && y[9] == 0))) {
		HAL_Delay(100);
	    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point9_x,%d,point9_y,%d,point9_color,%s,point10_x,%d,point10_y,%d,point10_color,%s\r\n",
	  	  	  										   x[8], y[8], &iotc_color_str[8][0], x[9], y[9], &iotc_color_str[9][0]);
	  }
	  if (!((x[10] == 0 && y[10] == 0) && (x[11] == 0 && y[11] == 0))) {
		HAL_Delay(100);
	    da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG point11_x,%d,point11_y,%d,point11_color,%s,point12_x,%d,point12_y,%d,point12_color,%s\r\n",
	  	  	  										   x[10], y[10], &iotc_color_str[10][0], x[11], y[11], &iotc_color_str[11][0]);
	  }
    }
    //IOTCONNECT to receive C2D message
	da16k_cmd_t current_cmd = {0};
	if ((da16k_get_cmd(&current_cmd) == DA16K_SUCCESS) && current_cmd.command) {
	  //USE current_cmd.command & current_cmd.parameters here
	  printf("/IOTCONNECT command is %s\r\n",current_cmd.command);
	  if (current_cmd.parameters) {
	    printf("/IOTCONNECT command->parameter is %s\r\n",current_cmd.parameters);
		da16k_at_send_formatted_raw_no_crlf("AT+NWICMSG iotc_cmd,%s,iotc_cmd_parameter,%s\r\n", current_cmd.command, current_cmd.parameters);
	  }
      da16k_destroy_cmd(current_cmd);
    }
  }
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_LTDC_CLK_SLEEP_ENABLE();     /* For display */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE(); 

